Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public ElementId GetReferencingId()
  Visual Basic
Public Function GetReferencingId As ElementId
  Visual C++
public:
ElementId^ GetReferencingId()
 See Also
  ExternalFileReference Class
  Autodesk.Revit.DB Namespace